import "./Article.css"
const ArticleData=[
    {
        id:0,
        title:"چرا از ریحون خرید کنیم؟",
        comment:"ریحون این امکان را برای شما فراهم می‌کند تا رستوران های اطرافتان را به راحتی مشاهده کنید و با بررسی منوهای عکس دار آن‌ها غذای مورد علاقه‌تان را به راحتی سفارش دهید و درب منزل یا محل کارتان تحویل بگیرید."
    },
    {
        id:1,
        title:"چرا از ریحون خرید کنیم؟",
        comment:"ریحون این امکان را برای شما فراهم می‌کند تا رستوران های اطرافتان را به راحتی مشاهده کنید و با بررسی منوهای عکس دار آن‌ها غذای مورد علاقه‌تان را به راحتی سفارش دهید و درب منزل یا محل کارتان تحویل بگیرید."
    },
    {
        id:2,
        title:"چرا از ریحون خرید کنیم؟",
        comment:"ریحون این امکان را برای شما فراهم می‌کند تا رستوران های اطرافتان را به راحتی مشاهده کنید و با بررسی منوهای عکس دار آن‌ها غذای مورد علاقه‌تان را به راحتی سفارش دهید و درب منزل یا محل کارتان تحویل بگیرید."
    },
    {
        id:3,
        title:"چرا از ریحون خرید کنیم؟",
        comment:"ریحون این امکان را برای شما فراهم می‌کند تا رستوران های اطرافتان را به راحتی مشاهده کنید و با بررسی منوهای عکس دار آن‌ها غذای مورد علاقه‌تان را به راحتی سفارش دهید و درب منزل یا محل کارتان تحویل بگیرید."
    }

]
 function renderArticleData(){
     const ArticleDataRendered=ArticleData.map(
         (part)=>
         <div key={part.id}>
            <h1>{part.title}</h1>
            <p>{part.comment}</p>
        </div>
     )
     return ArticleDataRendered
 }

const Article=()=>{

    return(
        <article class="article margin-v-45">
          {  renderArticleData()}

        </article>

    )
}
export default Article